run/crossFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET_AIR
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
                  
    INLET_LIQUID
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
                  
    WALL
    {
        type            noSlip;
    }
    
    SYMMETRY
    {
        type            symmetry;
    }
    
    OUTLET
    {

        type            inletOutlet;
        inletValue	    uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
