run/crossFlow/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET_AIR
    {
        type        fixedFluxPressure;
        value		uniform 0;
    }

    INLET_LIQUID
    {
        type        fixedFluxPressure;
        value		uniform 0;
    }

    WALL
    {
        type        fixedFluxPressure;
        value		uniform 0;
    }

    SYMMETRY
    {
        type        symmetry;
    }
  
    OUTLET
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
}

// ************************************************************************* //
