run/crossFlow/constant/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Name of liquid phase
phaseName       water;

// Droplet collision
collision       on;

// Droplet secondary breakup
breakupModel    ReitzDiwaker;

// FaceZones for postprocessing
faceZones       (fz1);

phaseCoupling
{
    active          on;

    // Start time
    startTime       0.01;

    // Interval for converting droplets
    nInterval       20;

    // Limit of alpha for droplet detection
    alphaLimit      0.002;

    // Maximum diameter of injected droplets
    dMax            0.002;

    // Maximum sphericity of injected droplets
    sphericity      2;
}

// ************************************************************************* //
